'use client'
import Image from "next/image";
import SingleCarPopupGallery from "../components/SingleCarPopupGallery";
import { useDispatch, useSelector } from "react-redux";
import { changeSingleGalleryStatus } from "@/redux/slices/globalSlice";
import CommonQuestionSection from "../components/CommonQuestionSection";
import { useState } from "react";

export default function FaqPage(){
    const [rules,setRules] = useState([
        {
            q:'قیمت بنزین در دبی چقدر است؟',
            a:'قیمت بنزین در دبی در ژانوبه 2024\nای پلاس (اکتان 97) 2/77درهم،\nاسپشیال (اکتان 95) 2/85 درهم (پیشنهادی)\nسوپر (اکتان 98) 2/96درهم\nدیزل 3/19 درهم است.'
        },
        {
            q:'آیا می‌توانم در دبی بدون گواهی رانندگی خودرو اجاره کنم؟',
            a:'رانندگی بدون گواهینامه در اجاره خودرو غیرقانونی است  و با جریمه نقدی یا حتی حبس ممکن است متجاوز مواجه شود. همچنین، در صورت وقوع حادثه، بیمه هزینه‌های خسارت را پوشش نمی‌دهد. رعایت قوانین حائز اهمیت است تا مشکلات حقوقی و مالی جلوگیری شود.'
        },
        {
            q:'چگونه و از کجا می‌توانم سیم‌کارت بخرم؟ و آیا واقعاً نیاز به آن دارم؟',
            a:'به طور معمول، در فرودگاه ممکن است یک سیم‌کارت رایگان با ۲ گیگابایت اینترنت به شما هدیه داده شود. اما اگر این امکان وجود ندارد، می‌توانید از غرفه‌های شرکت اتصالات که در تمام نقاط دبی فعالیت دارند، سیم‌کارت خود را تهیه کنید. برای یک بسته اینترنتی ۷ روزه، هزینه تقریبی میان ۷۰ الی ۱۰۰ درهم است. حتماً توصیه می‌شود که سیم‌کارت را دریافت کنید، زیرا برای استفاده از سرویس‌هایی مانند گوگل‌مپ و یافتن مسیرها، اتصال به اینترنت ضروری است.'
        },
        {
            q:'پارک خودرو در دبی چطوریه و چطور باید هزینه پارک رو پرداخت کرد؟',
            a:'در دبی، پارک خودرو در مناطق عمومی معمولاً نیاز به پرداخت هزینه دارد و سیستم پارکینگ بسیار منظم و دیجیتال است. شما می‌توانید هزینه پارک را به دو روش ساده پرداخت کنید:\nاز طریق اس‌ام‌اس (SMS): شماره پلاک، شماره منطقه و زمان پارک را به سامانه RTA ارسال کنید و پیام تأیید را دریافت کنید.\nاز طریق دستگاه‌های پارک کنار خیابان: با کارت بانکی یا سکه پرداخت کنید و رسید دریافت نمایید.\nهمچنین می‌توانید از اپلیکیشن‌های RTA Dubai و Dubai Drive  برای پرداخت، تمدید و پیدا کردن جای پارک استفاده کنید. دقت داشته باشید که پارک در مناطق ممنوعه یا دوبله ممکن است منجر به جریمه شود.'
        },
        {
            q:'چرا ما پیشنهاد می‌کنیم که خودرو را در فرودگاه دبی تحویل بگیرید؟',
            a:'تحویل خودرو در فرودگاه دبی نه تنها این امکان را به شما می‌دهد که خودروی خود را به سرعت و به صورت راحت دریافت کنید، بلکه از نظر مالی هم به شما مزایای قابل توجهی را ارائه می‌دهد. اگر خودرو را تا مقصد در محدوده هتل کرایه کنید، حداقل 150 درهم هزینه خواهید داشت. با تحویل خودرو در فرودگاه، شما نیازی به پرداخت هزینه تاکسی ندارید و مستقیماً از خودروی اجاره‌ای خود برای رفتن به مقصد خود استفاده می‌کنید. ما قویاً پیشنهاد می‌دهیم که حتماً خودرو را در فرودگاه تحویل بگیرید تا از این مزایا بهره‌مند شوید.'
        },
        {
            q:'چگونه می‌توانم گواهینامه رانندگی بین‌المللی دریافت کنم؟',
            a:'با مراجعه به یکی از دفاتر کانون اتومبیل‌رانی و ارائه اصل پاسپورت، یک عکس و گواهینامه رانندگی، می‌توانید در کمتر از ۱۵ دقیقه با پرداخت مبلغ حدود ۲۰۰ هزار تومان، گواهینامه رانندگی بین‌المللی خود را دریافت کنید.'
        },
        {
            q:'آیا اجاره ماشین در دبی به صرفه است؟',
            a:'اجاره خودرو در دبی به عنوان یک گزینه صرفه‌جویی هزینه تلقی می‌شود زیرا با پرداخت هزینه یک مسیر تاکسی، می‌توانید یک خودروی اجاره‌ای با قیمت مناسب از شرکت‌ پالم رنت استفاده کنید. این کاهش هزینه به شما این امکان را می‌دهد که بدون نگرانی از هزینه‌های مکرر تاکسی، به صورت اقتصادی و مستقل در سراسر شهر زیبای دبی حرکت کنید.\nبا اجاره خودرو، این امکان به شما می‌دهد که زمان مسافرت خود را بهینه‌سازی کنید و به سفرهای دلخواهتان بروید، بدون احتیاج به پرداخت مکرر هزینه تاکسی. در نتیجه، با اجاره خودرو، می‌توانید به صورت مستقل، اقتصادی‌تر و با انعطاف بیشتر در شهر دبی حرکت کنید.'
        },
        {
            q:'مدارک لازم برای اجاره خودرو در دبی چیست؟',
            a:'تصویر گواهینامه بین المللی\nتصوير پاسپورت'
        },
        {
            q:'تضمینات مورد نیاز برای اجاره خودرو در دبی',
            a:'مبلغ ودیعه (دپوزیت) مرتبط با جرایم احتمالی می‌باشد و به شرح زیر می‌باشد:\n- 1000 درهم برای خودروهای اقتصادی\n- 1500 درهم برای خودروهای متوسط\n- 2000 درهم برای خودروهای لوکس\n- 5000 درهم برای خودروهای سوپر لاکچری\n(مبالغ ودیعه (دپوزیت) زیر همه خودروها درج شده)\nاین مبالغ به صورت ریالی نیز پذیرفته می‌شود. در صورت عدم وقوع جریمه یا بدهی، این مبالغ حداکثر 20 روز کاری پس از تحویل خودرو به شرکت، به حساب مستأجر خودرو واریز خواهند شد.\nدر صورت تمایل به پرداخت ودیعه به صورت درهمی، مبلغ دو میلیون تومان جهت رزرو خودرو را از طریق سایت پرداخت کرده و مبلغ ودیعه به صورت نقدی هنگام تحویل خودرو دریافت خواهد شد. (مبلغ رزرو پس از دریافت خودرو به حساب متقاضی عودت خواهد شد)\nدر صورتی که ودیعه را به صورت ریالی پرداخت می‌کنید، مبلغ ودیعه ریالی با توجه به نوسانات نرخ ارز، کمی بیشتر از معادل درهمی دریافت می‌گردد و در صورت وجود جریمه، طبق نرخ روز و کارمزد، از مبلغ ریالی کسر خواهد شد.\nدر صورت رزرو خودرو و عدم تحویل، معادل ۲ روز هزینه اجاره خودرو دریافت خواهد شد.'
        },
        {
            q:'شرایط کنسلی چیست؟؟',
            a:'افرادی که از شرکت پالم رنت خودرو اجاره می‌کنند و پس از پرداخت پیش‌پرداخت و تکمیل رزرو، در صورت کنسلی یک روز اجاره، مبلغ مربوط به لغو این روز از مبلغ پرداختی کسر می‌شود.'
        },
        {
            q:'هزینه آوردن خودرو در لوکیشن دلخواه (ترانسفر) چقدر میباشد؟',
            a:'در دبی، هزینه‌ی ترانسفر به مقصد‌های مختلف از جمله فرودگاه، هتل یا هر مکان دیگر، برای هر سفر رفت 50 درهم و برگشت نیز 50 درهم است. اما در شارجه، هزینه برای هر سفر رفت و برگشت 200 درهم محاسبه می‌شود.'
        },
        {
            q:'قیمت اجاره ماشین استانبول چقدر است؟',
            a:'در بحث اجاره ماشین استانبول قیمت بر اساس نوع ماشین کرایه‌ای و همچنین روزانه یا ماهانه بودن تعیین می‌شود.'
        }
    ])
    return(
        <>
            <div className="xl:w-[85vw] w-[95vw] m-auto max-w-[1500x]">
                <div className="py-4">
                    <div className="text-center py-4 lg:text-[32px] md:text-2xl text-lg font-bold text-[#3B82F6]">
                        سوالات متداول
                    </div>
                    <CommonQuestionSection rules={rules} setRules={setRules} newVersion={true}/>
                </div>
            </div>
        </>

    )
}