'use client'
import CommonQuestionSection from "../components/CommonQuestionSection";
import { useEffect, useState } from "react";
import NProgress from 'nprogress'
import 'nprogress/nprogress.css'

export default function RulesPage(){
    useEffect(()=>{
                NProgress.start()
                const timeout = setTimeout(() => {
                NProgress.done()
                }, 300)
                return () => clearTimeout(timeout)
            },[])
    const [rules,setRules] = useState([
        {
            q:'پالم رنت، شرکت اجاره خودرو',
            a:'پالم رنت، شرکت اجاره خودرو با شعبه‌ها و نمایندگی‌های رسمی در اکثر شهرهای جهان است. این شرکت با سایت فوق پیشرفته و رزرو کاملاً آنلاین، با چند کلیک، بهترین قیمت را تضمین می‌کند و دارای بیشترین تنوع خودروهای نو و مدل جدید است. همچنین، مشتریان می‌توانند بدون نیاز به کارت اعتباری و با پرداخت ریالی از خدمات این شرکت استفاده کنند.'
        },
        {
            q:'مدارک موردنیاز',
            a:'گواهینامه بین‌المللی\nپاسپورت\nویزا'
        },
        {
            q:'بنزین',
            a:'هزینه بنزین به عهدهٔ مشتری است. لطفاً مطمئن شوید که خودرو را با همان مقدار بنزینی که در هنگام تحویل دارد، بازگردانید. در غیر این صورت، در صورت تحویل خودرو با کمتر از مقدار بنزین موجود در باک، هزینه بنزین از شما دریافت می‌شود. اما اگر بنزین اضافه تحویل دهید، هزینه‌ای به شما پرداخت نخواهد شد.'
        },
        {
            q:'تمدید رزرو',
            a:'به منظور تمدید رزرو، حداقل دو روز قبل از پایان دوره اجاره با تیم پشتیبانی پالم رنت تماس بگیرید. توجه داشته باشید که تمدید رزرو بستگی به شرایط موجود و ظرفیت خودروها دارد، بنابراین این امکان ممکن است در دسترس نباشد.'
        },
        {
            q:'هزینه پارکینگ',
            a:'مشتری مسئول پرداخت هزینه پارکینگ است. حتی اگر تحویل خودرو به صورت رایگان باشد، هرگونه هزینه پارکینگ، از جمله پارکینگ فرودگاه هنگام تحویل خودرو، باید توسط مشتری پرداخت شود.'
        },
        {
            q:'کنسل رزرو',
            a:'واریز پیش پرداخت داخل سایت به منزله رزرو قطعی بوده و در صورت انصراف و کنسل کردن رزرو، مبلغ پرداخت شده قابل عودت نمی‌باشد. توجه داشته باشید برای ثبت رزرو ابتدا نیازی به پرداخت پیش پرداخت نمی‌باشد.'
        },
        {
            q:'قوانین و مقررات اجاره خودرو در دبی',
            a:'شرایط سنی: راننده باید حداقل ۱۹ سال داشته باشد و حداقل یک سال از اخذ گواهینامه رانندگی وی گذشته باشد.\nگواهینامه بین‌المللی: شهروندان ایرانی برای اجاره خودرو در دبی باید دارای گواهینامه بین‌المللی معتبر باشند. فقط فردی که خودرو را اجاره می‌کند مجاز به رانندگی است. در صورت نیاز به راننده دوم یا سوم، اطلاعات گواهینامه بین‌المللی آن‌ها باید ثبت شود و هزینه اضافی خواهد داشت. درخواست صندلی کودک نیز شامل هزینه اضافی است.\nبیمه خودرو: تمام خودروها با بیمه کامل تحویل داده می‌شوند.'
        },
    ])
    return(
        <>
            <div className="xl:w-[85vw] w-[95vw] m-auto max-w-[1500x]">
                <div className="py-4">
                    <div className="text-center py-4 md:text-2xl sm:text-xl text-lg font-bold text-[#3B82F6]">
                        قوانین اجاره خودرو
                    </div>
                    <CommonQuestionSection rules={rules} setRules={setRules}/>
                </div>
            </div>
        </>

    )
}